In [1]:
import pandas as pd
import numpy as np

In [2]:
wc11 = pd.read_csv('wc11iaa.csv')
wc13 = pd.read_csv('wc13iaa.csv')
wc14 = pd.read_csv('wc14iaa.csv')
wc15 = pd.read_csv('wc15iaa.csv')
wc17 = pd.read_csv('wc17iaa.csv')
wc18 = pd.read_csv('wc18iaa.csv')
wc19 = pd.read_csv('wc19iaa.csv')

In [3]:
wc11.head(1)

   Rank             Gymnast      vt    ub      bb    fx   Total  year
0     1  Jordyn Wieber(USA)  15.716  13.6  15.266  14.8  59.382  2011

In [4]:
wc13.head(1)

   Rank            Gymnast     vt    ub      bb      fx   Total  year
0     1  Simone Biles(USA)  15.85  14.7  14.433  15.233  60.216  2013

In [5]:
wc14.head(1)

   Rank            Gymnast      vt      ub      bb      fx   Total  year
0     1  Simone Biles(USA)  15.866  14.533  14.766  15.066  60.231  2014

In [6]:
wc15.head(1)

   Rank            Gymnast      vt    ub    bb      fx   Total  year
0     1  Simone Biles(USA)  15.833  14.9  14.4  15.266  60.399  2015

In [7]:
wc17.head(1)

   Position      Gymnast      vt    ub      bb      fx   Total  year
0         1  Morgan Hurd  14.533  14.3  12.666  13.733  55.232  2017

In [8]:
wc17.rename(columns={'Position': 'Rank'}, inplace=True)

In [15]:
wc17.head(1)

   Rank      Gymnast      vt    ub      bb      fx   Total  year
0     1  Morgan Hurd  14.533  14.3  12.666  13.733  55.232  2017

In [9]:
wc18.head(1)

   rank          name      vt      ub      bb    fx   total  year
0     1  Simone Biles  14.533  14.725  13.233  15.0  57.491  2018

In [17]:
wc18.rename(columns={'name': 'Gymnast', 'total': 'Total', 'rank': 'Rank'}, inplace=True)

In [18]:
wc18.head(1)

   Rank       Gymnast      vt      ub      bb    fx   Total  year
0     1  Simone Biles  14.533  14.725  13.233  15.0  57.491  2018

In [19]:
wc19.head(1)

   Rank       Gymnast      vt      ub      bb    fx   Total  year
0     1  Simone Biles  15.233  14.733  14.633  14.4  58.999  2019

In [20]:
combined_df = pd.concat([wc11, wc13, wc14, wc15, wc17, wc18, wc19], axis=0)

In [21]:
combined_df

,Rank,Gymnast,vt,ub,bb,fx,Total,year
0,1,Jordyn Wieber(USA),15.716,13.600,15.266,14.800,59.382,2011
1,2,Viktoria Komova(RUS),14.933,15.400,14.683,14.333,59.349,2011
2,3,Yao Jinnan(CHN),14.966,14.933,13.933,14.766,58.598,2011
3,4,Aly Raisman(USA),15.233,12.900,14.525,14.900,57.558,2011
4,5,Huang Qiushuang(CHN),14.733,14.966,13.633,14.100,57.432,2011
...,...,...,...,...,...,...,...,...
19,20,Mélanie de Jesus dos Santos,14.633,11.933,13.500,13.500,53.566,2019
20,21,Cintia Rodríguez,13.333,13.700,11.833,12.600,51.466,2019
21,22,Lilia Akhaimova,14.533,12.066,11.400,13.466,51.465,2019
22,23,Naomi Visser,13.266,12.100,13.600,12.200,51.166,2019
23,24,Elisa Iorio,13.266,0.000,12.666,12.866,0.000,2019

In [22]:
df=combined_df.copy()

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 168 entries, 0 to 23
Data columns (total 8 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rank     168 non-null    int64
 1   Gymnast  168 non-null    object
 2   vt       168 non-null    float64
 3   ub       168 non-null    float64
 4   bb       168 non-null    float64
 5   fx       168 non-null    float64
 6   Total    168 non-null    float64
 7   year     168 non-null    int64
dtypes: float64(5), int64(2), object(1)
memory usage: 11.8+ KB

In [25]:
df['Gymnast'].value_counts()

Gymnast
Giulia Steingruber(SUI)     4
Elisabeth Seitz(GER)        3
Shang Chunsong(CHN)         3
Larisa Iordache(ROU)        3
Simone Biles(USA)           3
                           ..
Erika Fasana(ITA)           1
Ana Filipa Martins(POR)     1
Marta Pihan-Kulesza(POL)    1
Claudia Fragapane(GBR)      1
Elisa Iorio                 1
Name: count, Length: 116, dtype: int64

In [26]:
df['Gymnast'] = df['Gymnast'].str.replace(r'\(.*\)', '', regex=True)

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 168 entries, 0 to 23
Data columns (total 8 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rank     168 non-null    int64
 1   Gymnast  168 non-null    object
 2   vt       168 non-null    float64
 3   ub       168 non-null    float64
 4   bb       168 non-null    float64
 5   fx       168 non-null    float64
 6   Total    168 non-null    float64
 7   year     168 non-null    int64
dtypes: float64(5), int64(2), object(1)
memory usage: 11.8+ KB

In [30]:
# df.to_csv('wc11_19w_iaa.csv', index=False)